[
  {
    "id": 1,
    "question": "Define symmetric and asymmetric encryption and give an example of each.",
    "proposedAnswer": "Symmetric encryption uses the same key for encryption and decryption (e.g., AES), while asymmetric encryption uses a pair of keys, public and private, where the public key encrypts and the private key decrypts (e.g., RSA)."
  },
  {
    "id": 2,
    "question": "Describe the principle of operation for the Caesar cipher and its historical significance in cryptography.",
    "proposedAnswer": "The Caesar cipher shifts each letter in the plaintext by a set number down the alphabet for encryption. Historically, it was used by Julius Caesar for secure communication, marking an early use of substitution ciphers in cryptography."
  },
  {
    "id": 3,
    "question": "Explain what PKI is and its components, including digital certificates and certificate authorities.",
    "proposedAnswer": "Public Key Infrastructure (PKI) is a framework for secure digital communication. Key components include digital certificates, which authenticate the ownership of a public key, and certificate authorities (CAs), which issue and manage these certificates."
  },
  {
    "id": 4,
    "question": "What is a hash function in cybersecurity, and how does it contribute to data integrity?",
    "proposedAnswer": "A hash function is an algorithm that converts an input (or 'message') into a fixed-size string of bytes. It ensures data integrity by allowing verification that the content has not been altered, as any change would produce a different hash value."
  },
  {
    "id": 5,
    "question": "Explain how digital signatures work and their importance in ensuring the authenticity and integrity of electronic documents.",
    "proposedAnswer": "Digital signatures use asymmetric cryptography to validate the authenticity and integrity of a document. The sender encrypts the document's hash with their private key. The recipient decrypts it with the sender's public key, ensuring it hasn't been altered and confirming the sender's identity."
  },
  {
    "id": 6,
    "question": "Describe the three types of trust models mentioned: Direct Trust, Hierarchical Trust, and Web of Trust.",
    "proposedAnswer": "Direct Trust is based on individual assurance, Hierarchical Trust uses a centralized authority to validate identities, and Web of Trust builds a network of trust through individual validations without central authority."
  },
  {
    "id": 7,
    "question": "Distinguish between authentication and authorization in the context of database security.",
    "proposedAnswer": "Authentication verifies a user's identity, typically through credentials, while authorization determines the resources and operations the authenticated user is permitted to access and perform."
  },
  {
    "id": 8,
    "question": "Discuss the concept of 'strong cryptography' as defined by Bruce Schneier in the context of protecting against major government intrusions.",
    "proposedAnswer": "Strong cryptography refers to encryption that is sufficiently secure to prevent unauthorized access by major governments, relying on advanced algorithms and sufficiently long key lengths to resist decryption attempts."
  },
  {
    "id": 9,
    "question": "What are the challenges and solutions associated with key management in conventional encryption?",
    "proposedAnswer": "Key management challenges include securely distributing and storing keys, ensuring keys remain confidential, and updating keys. Solutions involve secure key exchange protocols, hardware security modules, and key lifecycle management practices."
  },
  {
    "id": 10,
    "question": "Explain the problem solved by public key cryptography, introduced by Whitfield Diffie and Martin Hellman.",
    "proposedAnswer": "Public key cryptography solves the key distribution problem, allowing secure communication without the need for a shared secret key by using a pair of keys for encryption (public key) and decryption (private key)."
  },
  {
    "id": 11,
    "question": "Summarize how PGP works and its hybrid approach to encryption.",
    "proposedAnswer": "PGP uses a hybrid approach that combines symmetric and asymmetric encryption. It encrypts the message with a symmetric session key, which is then encrypted with the recipient's public key. This method combines the efficiency of symmetric encryption with the security of asymmetric encryption."
  },
  {
    "id": 12,
    "question": "What is a certificate revocation list (CRL), and why is it important in cybersecurity?",
    "proposedAnswer": "A Certificate Revocation List (CRL) is a list of digital certificates that have been revoked before their expiration dates and are no longer trusted. It's crucial for maintaining the integrity of a secure communication infrastructure."
  },
  {
    "id": 13,
    "question": "Describe the purpose of a message digest and the significance of SHA-1 in ensuring data integrity.",
    "proposedAnswer": "A message digest is a unique digital fingerprint of data, ensuring integrity by detecting alterations. SHA-1 is a widely used hashing algorithm that produces a 160-bit digest, providing a high level of security against tampering."
  },
  {
    "id": 14,
    "question": "Discuss the evolution from DES to Triple-DES, including the reasons for the transition.",
    "proposedAnswer": "The transition from DES to Triple-DES was primarily due to DES's insufficient key length, making it vulnerable to brute-force attacks. Triple-DES uses three rounds of DES encryption with different keys, significantly enhancing security."
  },
  {
    "id": 15,
    "question": "List and explain at least three types of vulnerabilities mentioned, such as public key tampering and physical security breaches.",
    "proposedAnswer": "Public key tampering involves altering a public key to intercept encrypted communications. Physical security breaches include unauthorized access to secure locations. Viruses and Trojan horses can compromise system security by executing malicious actions without the user's knowledge."
  },
  {
    "id": 16,
    "question": "Outline Phil Zimmermann’s rationale behind creating PGP and its relevance to privacy and security.",
    "proposedAnswer": "Phil Zimmermann created PGP to ensure private and secure electronic communication in the digital age, advocating for the right to privacy and the importance of strong encryption to protect against unauthorized access and surveillance."
  },
  {
    "id": 17,
    "question": "Discuss the principles of database security and the importance of protecting key fields and access to surrogate information.",
    "proposedAnswer": "Database security principles include ensuring data confidentiality, integrity, and availability. Protecting key fields and surrogate information is vital to prevent unauthorized access and ensure that sensitive data remains secure."
  },
  {
    "id": 18,
    "question": "Explain what traffic analysis is and how it poses a threat to encrypted communications.",
    "proposedAnswer": "Traffic analysis involves examining communication patterns to infer sensitive information without decrypting the content. It poses a threat by potentially revealing the parties involved in communications and their frequency, even when the content is encrypted."
  },
  {
      "id": 19,
      "question": "Describe the Feistel structure and its significance in the design of block ciphers.",
      "proposedAnswer": "The Feistel structure is a design model used in block cipher algorithms, enabling the construction of encryption and decryption processes from the same components. Its significance lies in its flexibility and the ease of implementing secure encryption algorithms."
  },
  {
      "id": 20, 
      "question": "Define cryptanalysis and distinguish between classical cryptanalysis and modern techniques such as differential and linear cryptanalysis.",
      "proposedAnswer": "Cryptanalysis is the study of analyzing and breaking cryptographic systems. Classical cryptanalysis uses techniques like frequency analysis, while modern methods like differential and linear cryptanalysis exploit mathematical properties of the encryption algorithm to find weaknesses."
  },
    {
      "id": 21,
      "question": "Define symmetric and asymmetric encryption and give an example of each.",
      "proposedAnswer": "Symmetric encryption uses the same key for encryption and decryption (e.g., AES), while asymmetric encryption uses a pair of keys, public and private, where the public key encrypts and the private key decrypts (e.g., RSA)."
    },
    {
      "id": 22,
      "question": "Describe the principle of operation for the Caesar cipher and its historical significance in cryptography.",
      "proposedAnswer": "The Caesar cipher shifts each letter in the plaintext by a set number down the alphabet for encryption. Historically, it was used by Julius Caesar for secure communication, marking an early use of substitution ciphers in cryptography."
    },
    {
      "id": 23,
      "question": "Explain what PKI is and its components, including digital certificates and certificate authorities.",
      "proposedAnswer": "Public Key Infrastructure (PKI) is a framework for secure digital communication. Key components include digital certificates, which authenticate the ownership of a public key, and certificate authorities (CAs), which issue and manage these certificates."
    },
    {
      "id": 24,
      "question": "What is the CIA Triad in information security and why is it important?",
      "proposedAnswer": "The CIA Triad stands for Confidentiality, Integrity, and Availability. It is important because it represents the core principles of information security, ensuring that information is protected from unauthorized access, remains accurate and reliable, and is accessible to authorized users when needed."
    },
    {
      "id": 25,
      "question": "Discuss the role and importance of digital signatures in cybersecurity.",
      "proposedAnswer": "Digital signatures play a critical role in cybersecurity by providing a way to verify the authenticity and integrity of digital messages and documents. They use cryptographic techniques to ensure that the signer is verified and that the content has not been altered, supporting nonrepudiation."
    },
    {
      "id": 26,
      "question": "What are the main differences between symmetric and asymmetric encryption, and when is each type typically used?",
      "proposedAnswer": "Symmetric encryption uses the same key for both encryption and decryption, making it fast and efficient for encrypting large amounts of data. Asymmetric encryption uses a public and private key pair, offering enhanced security for key exchange and digital signatures. Symmetric encryption is typically used for bulk data encryption, while asymmetric encryption is used for secure key exchange and authentication."
    },
    {
      "id": 27,
      "question": "Explain the concept of a trust model in the context of PKI. Provide examples of different types of trust models.",
      "proposedAnswer": "A trust model defines how parties in a network trust each other's identities. In PKI, common trust models include the hierarchical trust model, where a central root authority issues certificates; the web of trust model, where users create their own certificates and trust is established through mutual verification; and the direct trust model, where trust is established through direct exchange and verification of certificates."
    },
    {
      "id": 28,
      "question": "Describe the process and importance of certificate revocation in PKI.",
      "proposedAnswer": "Certificate revocation is the process of invalidating a digital certificate before its expiration date. This is important to ensure that compromised or no longer valid certificates cannot be used maliciously. Revocation is typically managed through Certificate Revocation Lists (CRLs) or the Online Certificate Status Protocol (OCSP), which allow users and systems to verify the current status of a certificate."
    },
    {
      "id": 29,
      "question": "What are the primary threats to database security and how can they be mitigated?",
      "proposedAnswer": "Primary threats to database security include SQL injection attacks, unauthorized access, and data breaches. These can be mitigated through methods such as input validation and prepared statements to prevent SQL injection, robust access control mechanisms to ensure only authorized users can access data, and encryption to protect data at rest and in transit."
    },
    {
      "id": 30,
      "question": "Explain the concepts of authentication and authorization and their significance in information security.",
      "proposedAnswer": "Authentication is the process of verifying the identity of a user or system, typically through credentials such as passwords, biometrics, or tokens. Authorization determines what an authenticated user is allowed to do, often managed through role-based or attribute-based access control. Both are critical for ensuring that only authorized users can access and perform actions on information systems."
    },
    {
      "id": 31,
      "question": "How does the Online Certificate Status Protocol (OCSP) enhance security in PKI compared to traditional Certificate Revocation Lists (CRLs)?",
      "proposedAnswer": "OCSP enhances security by providing real-time verification of a certificate's revocation status, unlike CRLs, which are periodically updated lists. OCSP allows clients to query the status of a certificate directly from the issuing CA, ensuring that the most current information is used to determine a certificate's validity, thus improving the reliability of the revocation process."
    },
    {
      "id": 32,
      "question": "What are the key differences between a web of trust and a hierarchical trust model?",
      "proposedAnswer": "In a web of trust, individuals mutually verify each other's keys, creating a decentralized network of trust relationships. In contrast, a hierarchical trust model relies on a central root authority and intermediate authorities to issue and manage certificates, establishing a structured and centralized trust hierarchy. The web of trust is more flexible but less structured, while the hierarchical model provides a clear and organized trust framework."
    }
  ]
  